# Reloj base (50 MHz nominal de la placa)
create_clock -name clk_50 -period 20.000 [get_ports {CLOCK_50}]

# El reset asíncrono no debe limitar fmax
set_false_path -from [get_ports {KEY[*]}]

# (Opcional) Evita que los pines I/O influyan en análisis de setup/hold
set_input_delay  0 -clock clk_50 [get_ports {SW[*]}]
set_output_delay 0 -clock clk_50 [get_ports {LEDR[*]}]
